# IsModelInCloud Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..IsModelInCloud Property
Document Class See Also
---
Identifies if document is stored on Autodesk cloud services.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public bool IsModelInCloud { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsModelInCloud As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsModelInCloud {
	bool get ();
}
```

# See Also
Document Class
Autodesk.Revit.DB Namespace